Revit 2024 API
BuiltInFailures.ViewFailures.ZeroLengthViewBreaksRemoved Property
 Some View Regions were consolidated. When the size of a View Break between View Regions becomes zero, the View Break is removed and the adjacent View Regions are joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ZeroLengthViewBreaksRemoved { get; }
Visual Basic
Public Shared ReadOnly Property ZeroLengthViewBreaksRemoved As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ZeroLengthViewBreaksRemoved {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace